# Series in Pandas

In [69]:
#import pandas and numpy
import numpy as np
import pandas as pd

In [70]:
#lets creat list, lable, disctionary, and numpy array
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [71]:
#Convert your list, numpy array, and disctionary into the series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [72]:
#creat two series and grab information from the indexes
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [73]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan']) 
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [74]:
ser1['USA']

1

In [75]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames in Pandas

In [76]:
#import randn from the numpy library and set the seed
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [77]:
#generate dataframe with 5 rows and 4 columns and set the index
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
#grab the information from the first columns
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [79]:
#pass a list of column names
df[['W','Z']]
#type(df['W'])

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [80]:
#creat new column in your dataframe

df['new']= df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [81]:
#remove a column from your dataframe
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [83]:
#inplace the dataframe 
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
#drop the last row from your dataframe
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [85]:
#select your first row from your dataframe
df.loc['A']
#df.iloc[2]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [86]:
#select subset of rows and columns from your dataframe
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [87]:
#find out the positive numbers from your dataframe with conditional selection
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
#Reset your dataframe to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [90]:
#add new column and set that column as an index to your dataframe
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [91]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [92]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [93]:
#inplace your new dataframe
df.set_index('States',inplace=True)
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [94]:
#obtain summary data on your dataframe
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

# Missing Data

In [95]:
#define new (3,3) dataframe by using dictionary
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [96]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [97]:
#remove NaN valus from the dataframe
df.dropna()

     A    B  C
0  1.0  5.0  1

In [98]:
#remove the NaN values from all columns
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [99]:
#set the thresh value of 2 and drop other nan
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [100]:
#set other name for cells with nan
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [101]:
#fill the first column nan value with mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [102]:
#Creat a dataframe from provided dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [103]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [104]:
#let's group based off of Company
df.groupby('Company')

In [105]:
#save the new object into the new variable
by_comp=df.groupby('Company')

In [106]:
#use diffrent aggrigate method to find out the sales for each company (mean, min, max,..)
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

# Operations

In [107]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [108]:
#find unique values in col2
df['col2'].unique()

array([444, 555, 666])

In [109]:
#find number of unique numbers in col2
df['col2'].nunique()

3

In [110]:
#count the unique numbers in col2
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [111]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [112]:
newdf

   col1  col2 col3
3     4   444  xyz

In [113]:
#apply provided function to col1
def times2(x):
    return x*2

In [114]:
#find out how many words do we have in col3 (use apply function)
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [115]:
#calculate the sum of col1
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [116]:
#permanently remove the col1
del df['col1']

In [117]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [118]:
#get column and index names
#df.columns
df.index

RangeIndex(start=0, stop=4, step=1)

In [119]:
#use sort function to sort the values for col2
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [120]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

# Data Input and Output

In [121]:
#read the (example) csv file 
df = pd.read_csv('/content/drive/MyDrive/Copy of example.csv')

In [122]:
#save the (example) csv file
df.to_csv('/content/drive/MyDrive/Copy of example.csv',index=False)

In [123]:
#read the (Excel_Sample) file
df= pd.read_excel('/content/drive/MyDrive/Copy of Excel_Sample.xlsx', sheet_name='Sheet1')

# lets apply what you learned to the pandas exercises

In [124]:
#1. Import pandas and read in the population_by_county.csv file into a dataframe called pop.
import pandas as pd

In [125]:
#2. Show the head of the dataframe
pop = pd.read_csv('/content/drive/MyDrive/Copy of population_by_county.csv')
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [126]:
#3. What are the column names?
pop.columns

Index(['County', 'State', '2010Census', '2017PopEstimate'], dtype='object')

In [127]:
#4. How many States are represented in this data set? 
pop['State'].nunique()

51

In [128]:
#5. Get a list or array of all the states in the data set.
pop['State'].unique()

array(['South Carolina', 'Louisiana', 'Virginia', 'Idaho', 'Iowa',
       'Kentucky', 'Missouri', 'Oklahoma', 'Colorado', 'Illinois',
       'Indiana', 'Mississippi', 'Nebraska', 'North Dakota', 'Ohio',
       'Pennsylvania', 'Washington', 'Wisconsin', 'Vermont', 'Minnesota',
       'Florida', 'North Carolina', 'California', 'New York', 'Wyoming',
       'Michigan', 'Alaska', 'Maryland', 'Kansas', 'Tennessee', 'Texas',
       'Maine', 'Arizona', 'Georgia', 'Arkansas', 'New Jersey',
       'South Dakota', 'Alabama', 'Oregon', 'West Virginia',
       'Massachusetts', 'Utah', 'Montana', 'New Hampshire', 'New Mexico',
       'Rhode Island', 'Nevada', 'District of Columbia', 'Connecticut',
       'Hawaii', 'Delaware'], dtype=object)

In [129]:
#6. What are the five most common County names in the U.S.?
pop['County'].value_counts().head()

Washington County    30
Jefferson County     25
Franklin County      24
Lincoln County       23
Jackson County       23
Name: County, dtype: int64

In [130]:
#7. What are the top 5 most populated Counties according to the 2010 Census?
pop.sort_values('2010Census', ascending=False).head()

                  County       State  2010Census  2017PopEstimate
1713  Los Angeles County  California     9818605         10163507
628          Cook County    Illinois     5194675          5211263
1209       Harris County       Texas     4092459          4652980
1784     Maricopa County     Arizona     3817117          4307033
2501    San Diego County  California     3095313          3337685

In [131]:
#8. What are the top 5 most populated States according to the 2010 Census?
pop.groupby('State').sum().sort_values('2010Census', ascending=False).head()

            2010Census  2017PopEstimate
State
California    37253956         39536653
Texas         25145561         28304596
New York      19378102         19849399
Florida       18801310         20984400
Illinois      12830632         12802023

In [132]:
#9. How many Counties have 2010 populations greater than 1 million?
sum(pop['2010Census']>1000000)

39

In [133]:
#10. How many Counties don't have the word "County" in their name?
sum(pop['County'].apply(lambda name: 'County' not in name))

135

In [134]:
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [135]:
#11. Add a column that calculates the percent change between the 2010 Census and the 2017 Population Estimate
pop['PercentChange'] = 100*(pop['2017PopEstimate']-pop['2010Census'])/pop['2010Census']
pop.head()

             County           State  2010Census  2017PopEstimate  PercentChange
0  Abbeville County  South Carolina       25417            24722      -2.734390
1     Acadia Parish       Louisiana       61773            62590       1.322584
2   Accomack County        Virginia       33164            32545      -1.866482
3        Ada County           Idaho      392365           456849      16.434697
4      Adair County            Iowa        7682             7054      -8.174954

In [136]:
#12. What States have the highest estimated percent change between the 2010 Census and the 2017 Population Estimate?
pop2 = pd.DataFrame(pop.groupby('State').sum())
pop2['PercentChange'] = 100*(pop2['2017PopEstimate']-pop2['2010Census'])/pop2['2010Census']
pop2.sort_values('PercentChange', ascending=False).head()

                      2010Census  2017PopEstimate  PercentChange
State
District of Columbia      601723           693972      15.330808
Texas                   25145561         28304596      12.562993
North Dakota              672591           755393      12.310899
Utah                     2763885          3101833      12.227282
Florida                 18801310         20984400      11.611372